{"title":"Armchair Expert with Dax Shepard","description":"Hi, I’m Dax Shepard, and I love talking to people. I am endlessly fascinated by the messiness of being human, and I find people who are vulnerable and honest about their struggles and shortcomings to be incredibly sexy. I invite you to join me as I explore other people’s stories. We will celebrate, above all, the challenges and setbacks that ultimately lead to growth and betterment. What qualifies me for such an endeavor? More than a decade of sobriety, a degree in Anthropology and four years of improv training. I will attempt to discover human “truths” without any laboratory work, clinical trials or data collection. I will be, in the great tradition of 16th-century scientists, an Armchair Expert.","author":"Armchair Umbrella","image":"https://media.simplecast.com/podcast/image/4123/1517966385-artwork.jpg","items":[{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9mOWY2MjMzNS5tcDM=","title":"Armchair Expert Holiday Spectacular","description":"Join us for our first annual holiday party featuring musical guests Jackie Tohn, Hannah Anderson and Kristen Bell. Also, Monica, Dax and Wobby Wob reflect on the year.\n","publishedDate":"Mon, 24 Dec 2018 00:30:00 -0800","duration":"01:28:44","audioUrl":"https://audio.simplecast.com/f9f62335.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS81YzFkODY1ZC5tcDM=","title":"Josh Duhamel","description":"Josh Duhamel (Transformers, NBC's Las Vegas, When In Rome, Love, Simon) is an American actor, model and director. Josh sits down with the Armchair Expert to discuss his dad's breed of tough love, his struggle to become less of a people pleaser and how Steven Spielberg changed his life. Josh recounts the time he beat Ashton Kutcher in a modeling contest and Dax commits to objectifying Josh's body. The two talk about soap opera acting, how men prove their friendship and Dax and Monica reveal the most epic white elephant gift in the fact check.\n","publishedDate":"Thu, 20 Dec 2018 00:30:00 -0800","duration":"01:34:30","audioUrl":"https://audio.simplecast.com/5c1d865d.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS8zMDU5YTE4Yy5tcDM=","title":"Sean Hayes","description":"Sean Hayes (Will and Grace, The Bucket List, Sean Saves The World) is an American actor, comedian, producer and worlds most lovable human. Sean sits down with the Armchair Expert to discuss diffusing hardship with humor, he examines the bedrock for his people-pleasing nature and he reveals the advice Dax gave him that led to his public coming out. He talks about his affinity for matching pajamas and Dax tells the story of how he had butterflies after the first time he met Sean. Sean talks about his journey to Will and Grace, Dax wants Sean to have a baby and Monica and Dax debate why all old people are short on the fact check.\n","publishedDate":"Mon, 17 Dec 2018 00:30:00 -0800","duration":"01:59:15","audioUrl":"https://audio.simplecast.com/3059a18c.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS83MjM2ZTkzYy5tcDM=","title":"LIVE FROM BROOKLYN: Jason Biggs","description":"Armchair Expert Live from Brooklyn at the Brooklyn Academy of Music. September 22nd, 2018.\n","publishedDate":"Thu, 13 Dec 2018 00:30:00 -0800","duration":"02:01:53","audioUrl":"https://audio.simplecast.com/7236e93c.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS8xMDc5NmFjYy5tcDM=","title":"Sophia Bush","description":"Sophia Bush (One Tree Hill, John Tucker Must Die, Chicago P.D.) is an American actress and activist. She sits down with the Armchair Expert to discuss her love of stunt driving, her experience being a woman in Hollywood and the steps she's taken toward self-fulfillment. Dax gives a solid piece of advice to young actresses and Sophia unknowingly drops Monica and Dax's favorite vocabulary words. The two talk about the path to learning from your previous mistakes, Sophia discusses reaching fame from a locational distance and in the fact check, Monica and Dax entertain the notion of Barack Obama fathering Monica's hypothetical child.\n","publishedDate":"Mon, 10 Dec 2018 00:30:00 -0800","duration":"01:48:07","audioUrl":"https://audio.simplecast.com/10796acc.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS8zYTgwZDZlYy5tcDM=","title":"EXPERTS ON EXPERT: Jonathan Haidt","description":"Jonathan Haidt is an author, moral psychologist and Professor of Ethical Leadership at New York University's Stern School of Business. He sits down with the Armchair Expert to discuss moral panic on college campuses, the benefits of independence in childhood and the inherent difference in moral attitudes between the political left and right. The two talk about the failure of American systems, the ways in which we are breeding a generation of anxiety/depression and Monica and Dax pontificate on whether incest is immoral in the fact check.\n\nJonathan Haidt is the author of The Righteous Mind, The Happiness Hypothesis and The Coddling of The American Mind.  Subscribe to Experts on Expert: http://bit.ly/exponexp\n","publishedDate":"Thu, 06 Dec 2018 00:30:00 -0800","duration":"02:09:13","audioUrl":"https://audio.simplecast.com/3a80d6ec.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9mMjAyNjc4My5tcDM=","title":"Andrea Savage","description":"Andrea Savage (Step Brothers, Veep, I’m Sorry) is an American actress, comedian, and writer. Andrea sits down with the Armchair Expert to discuss her family of teeth, her profound realization after getting cut from the Groundlings and her physical resemblance to Julia Roberts. Andrea talks about a cat-centric traumatic event in her household and Dax wonders if Andrea remembers the time he arrived at her house on ecstasy. The two travel down memory lane about their previous romantic encounter and they talk about recent deaths in their respective families and what they gleaned from the experience.\n","publishedDate":"Mon, 03 Dec 2018 00:30:00 -0800","duration":"02:06:08","audioUrl":"https://audio.simplecast.com/f2026783.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS8yMDc1MjgwZC5tcDM=","title":"LIVE FROM BROOKLYN: Ethan Hawke & Vincent D'Onofrio","description":"Armchair Expert Live from Brooklyn at the Brooklyn Academy of Music. September 22nd, 2018.\n","publishedDate":"Thu, 29 Nov 2018 00:30:00 -0800","duration":"01:44:22","audioUrl":"https://audio.simplecast.com/2075280d.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS8wYTU5ZjkzNy5tcDM=","title":"Conan O'Brien","description":"Conan O'Brien (Saturday Night Live, The Simpsons, Late Night, Conan) is an American television host, comedian, writer, and producer. Conan sits down with the Armchair Expert to discuss the sad truth of bicycle accident funerals, his propensity for kindness after having consumed alcohol and how he has let humility become a guiding principle in his life.  Dax is sad Conan never went to the playboy mansion and Conan corrects Dax's grammatical indiscretions. The two talk about the duality between control and chaos, they defend the idea that all parents should be slightly addicted to alcohol, they declare the certain fate of class clowns and Conan denies Monica's request to be friends.\n","publishedDate":"Mon, 26 Nov 2018 00:30:00 -0800","duration":"02:00:47","audioUrl":"https://audio.simplecast.com/0a59f937.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9mZjBjOGM2My5tcDM=","title":"EXPERTS ON EXPERT: Sam Harris","description":"Sam Harris is an American author, neuroscientist and podcast host.  As the most referenced person on Armchair Expert, Sam enters the attic with an unparalleled reverence. On this special Thanksgiving episode of Experts on Expert, Sam makes our podcast dreams come true. The two discuss Sam’s commitment to honesty, they talk about the country’s political polarization and they consider the idea of separating art from the artist.   Dax wonders if Sam operates out of fear,  Sam talks about his battle with Batman and Sam attempts to take his foot out of Dax’s mouth.\n","publishedDate":"Thu, 22 Nov 2018 00:30:00 -0800","duration":"02:37:42","audioUrl":"https://audio.simplecast.com/ff0c8c63.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9lNzA0OGFkZC5tcDM=","title":"Debby Ryan","description":"Debby Ryan (The Suite Life on Deck, Jessie, Insatiable) is an American actress, singer and the youngest guest thus far on Armchair Expert. Debby sits down in the attic to discuss her childhood in Germany, her struggle with body dysmorphia and her experience as a Disney star. Debby talks about how she uses boxing as an outlet and Dax thinks Millie Bobby Brown looks like Tom Wilkinson. The two wonder if there is an onslaught of victimhood occurring in young people, they discuss Debby's lack of romantic interests and Debby impresses Dax with her first car purchase.\n","publishedDate":"Mon, 19 Nov 2018 00:30:00 -0800","duration":"02:12:04","audioUrl":"https://audio.simplecast.com/e7048add.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9mNjdhNzc3Mi5tcDM=","title":"LIVE FROM DALLAS: Gordon Keith","description":"Armchair Expert Live from Dallas at The Majestic Theatre. August 18th, 2018.\n","publishedDate":"Thu, 15 Nov 2018 00:30:00 -0800","duration":"01:53:35","audioUrl":"https://audio.simplecast.com/f67a7772.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9kNzEwMjMyOC5tcDM=","title":"Ira Glass","description":"Ira Glass is an American public radio personality and the host and producer of the radio and television show This American Life. The armchair experts travel to NYC to record in the esteemed This American Life studios. In this special remote episode, Ira discusses the psychology behind affairs and why he is drawn to monogamy, he talks about his journey as a radio personality, and he contemplates his sense of control in his work. Dax wonders about what it feels like to be the conduit for other show’s success and Ira reveals what he deems is the best podcast right now. Dax tells Ira that being a part of a This American Life story was a career highlight and Ira can’t decide if he likes Kristen or Dax more.\n","publishedDate":"Mon, 12 Nov 2018 00:30:00 -0800","duration":"01:59:35","audioUrl":"https://audio.simplecast.com/d7102328.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9hMGIyMjUyYi5tcDM=","title":"EXPERTS ON EXPERT: Jerry Buting","description":"Jerry Buting (Making A Murderer) is an American criminal defense attorney and author. He sits down with the Armchair Expert to discuss the mechanics of the justice system, his perpetual desire to root for the underdog and his recent book- Illusion of Justice. Dax asks Jerry about stereotypes in jury selection and Jerry breaks down the necessity of burden of proof. The two talk about the secret skills of an attorney, ethics in justice, false confessions and how the Steven Avery case catapulted him to dreamboat status.\n\nSubscribe to Experts on Expert: http://bit.ly/exponexp\n","publishedDate":"Thu, 08 Nov 2018 00:30:00 -0800","duration":"01:56:55","audioUrl":"https://audio.simplecast.com/a0b2252b.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9lNzYzODMyZS5tcDM=","title":"Mark Duplass","description":"Mark Duplass (The Puffy Chair, Jeff Who Lives at Home, The League) is an American film director, film producer, actor, musician, screenwriter, author and old buddy of the Armchair Expert. Mark sits down in the attic to discuss his happiness living in the B+ range of his industry, he talks about  a recent conscious uncoupling with his work partner/brother and he contemplates the reasons behind his workaholic sensibility. Dax details his writing routine and Mark reveals the trick Ray Romano taught him of how to make a joke land. Dax and Mark reminisce on a joyous time in their life when they would get together, watch old movies and dissect the male form. \n","publishedDate":"Mon, 05 Nov 2018 00:30:00 -0800","duration":"02:00:16","audioUrl":"https://audio.simplecast.com/e763832e.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS8zOGZlYmVjNy5tcDM=","title":"Lena Dunham","description":"Lena Dunham (Girls, Tiny Furniture, Camping) is an American actress, writer, producer and director. Lena sits down with the Armchair Expert to discuss body image in Hollywood, how she handles haters on social media and the series of events that led to her showing Brad Pitt her underwear.  Dax and Lena commiserate over their autoimmune disorders and they discuss the process of relationship growth. Lena talks about her recent path that’s led to deep self-exploration and Dax tells of the time he rescued Lesley Arfin from the basement of the Maritime hotel. \n","publishedDate":"Mon, 29 Oct 2018 00:30:00 -0700","duration":"02:03:59","audioUrl":"https://audio.simplecast.com/38febec7.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9iNWNhYzIyOC5tcDM=","title":"LIVE FROM AUSTIN: Brené Brown","description":"Armchair Expert Live from Austin at The Paramount Theatre. August 17th, 2018.\n","publishedDate":"Thu, 25 Oct 2018 00:30:00 -0700","duration":"01:58:05","audioUrl":"https://audio.simplecast.com/b5cac228.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9lNDJlZWI1Mi5tcDM=","title":"Rob McElhenney","description":"Rob McElhenney (It’s Always Sunny in Philadelphia, Fargo) is an American actor, director, producer, writer and one of Dax’s idols. Rob sits down with the Armchair Expert to discuss raising young boys, he ponders celebrities role in social media and he details the multiple times he’s drastically changed his body. Dax exalts Rob’s discipline and in response Rob explains why he often sees that trait as a vice not a virtue.  Rob and Dax talk about Brazilian jujitsu, they mutually gush over Kaitlin Olson and Dax is obsessed with Rob’s gym.\n","publishedDate":"Mon, 22 Oct 2018 00:30:00 -0700","duration":"02:23:53","audioUrl":"https://audio.simplecast.com/e42eeb52.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9iOWQ5ZjllMi5tcDM=","title":"EXPERTS ON EXPERT: Dr. Drew","description":"Dr. Drew Pinsky (Dr. Drew on Call, Loveline, Celebrity Rehab with Dr. Drew) is a board-certified internist, addiction medicine specialist, and media personality. On this episode of Experts on Expert, Dr. Drew discusses balancing ambition and family, how gut instinct is linked to the brain, and his reasoning for advocating the 12 step program. The two talk about monogamy and sex addiction, they list the myriad effects of suboxone and they chat about our ego's inability to separate self and family.  Dr. Drew details some of his public blunders, he talks through the criticisms of Celebrity Rehab and Monica and Dax engage in a strange Foley exercise in the fact check.\n","publishedDate":"Thu, 18 Oct 2018 00:30:00 -0700","duration":"02:21:43","audioUrl":"https://audio.simplecast.com/b9d9f9e2.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9hZTNhNDQzOC5tcDM=","title":"Amy Schumer","description":"Amy Schumer (Inside Amy Schumer, Trainwreck, I Feel Pretty) is an American stand-up comedian, actress and Queen of all things. Amy sits down with the Armchair Expert to discuss body confidence, how she met her husband and her general contentment with death. Amy talks about the ubiquitous fear women harbor and Dax is excited they both share the title of Class Clown. The two veer into a conversation about gender differences that left Dax feeling regretful after the recording. Monica and Dax discuss the aftermath and resolution of that moment during the fact check. \n","publishedDate":"Mon, 15 Oct 2018 00:30:00 -0700","duration":"01:39:39","audioUrl":"https://audio.simplecast.com/ae3a4438.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9mMWZkZTRkMi5tcDM=","title":"LIVE FROM LOS ANGELES: Jason Ritter","description":"Armchair Expert Live from Los Angeles at Largo at the Coronet. June 30th, 2018.\n","publishedDate":"Thu, 11 Oct 2018 00:30:00 -0700","duration":"01:59:25","audioUrl":"https://audio.simplecast.com/f1fde4d2.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9mYWI4ODI5OC5tcDM=","title":"Seth Meyers","description":"Seth Meyers (Saturday Night Live, Late Night with Seth Meyers) is an American comedian, writer, political commentator, actor, and television host. The Armchair Expert travels to 30 Rock to discuss being beta to their female alpha counterparts and the uncomfortable competition that happens among friends in a sketch environment. Seth talks about the time Brad Paisley saved him from having to dance at his wedding, he discusses the balance between work and family and he details the highest moment during his day. Dax puts Seth at the top of the \"hardest workers\" list and Seth reveals the secret to getting Lorne Michaels to like you. \n","publishedDate":"Mon, 08 Oct 2018 00:30:00 -0700","duration":"01:24:07","audioUrl":"https://audio.simplecast.com/fab88298.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9hNDg5YzYzNC5tcDM=","title":"EXPERTS ON EXPERT: Yuval Noah Harari","description":"In this episode of Experts on Expert, the Armchair Expert speaks to author, professor and Israeli historian, Yuval Noah Harari. In this far too brief episode, Yuval discusses the differences between our experiential and narrative selves, he talks about a not so distant future in which AI will drastically alter the workforce and he theorizes on why the technological evolution could potentially warrant the return of communism. The two discuss the idea of myths, virtual reality and security. Dax and Monica mourn the fact that they only had an hour with Yuval and Dax takes an armcherry song request in the fact check. \n\nYuval Noah Harari is a tenured professor in the Department of History at the Hebrew University of Jerusalem. He is the author of the international bestsellers Sapiens: A Brief History of Humankind, Homo Deus: A Brief History of Tomorrow, and 21 Lessons for the 21st Century. \n","publishedDate":"Thu, 04 Oct 2018 00:30:00 -0700","duration":"01:20:43","audioUrl":"https://audio.simplecast.com/a489c634.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS81ZTM4ZWU0Zi5tcDM=","title":"Wendi McLendon-Covey","description":"Wendi McLendon-Covey (Reno 911, Bridesmaids, The Goldbergs) is an American actress and comedian. Wendi sits down with the Armchair Expert to discuss their time at the Groundlings together, she talks about her family’s initial disapproval in her career and she reminisces on the horror of commercial auditions. Wendi talks about her decision to not have children and Dax tells of the time a hotel had to change their protocol due to one of his sexual encounters. The two touch on the topic of monogamy in Hollywood, they speculate on why there hasn’t been a sequel to Bridesmaids and Monica and Dax go on a field trip for the fact check.\n","publishedDate":"Mon, 01 Oct 2018 00:30:00 -0700","duration":"01:55:43","audioUrl":"https://audio.simplecast.com/5e38ee4f.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9hMDQzMzRiMi5tcDM=","title":"The Good Place Week: Kristen Bell","description":"She’s BAAAAAACKKKKK!!!!!! Kristen Bell rounds out The Good Place week by sitting down with the Armchair Expert (again) to discuss stereotypes, she gives advice on how to handle aggravating situations and she talks about why season 3 of The Good Place is the best yet. Dax asks Kristen to name the times he’s embarrassed her and Kristen refuses to wear headphones. Kristen and Monica name the reasons they love each other and they detail the layers of their baby/mother/wife relationship.\n","publishedDate":"Thu, 27 Sep 2018 00:05:00 -0700","duration":"01:52:14","audioUrl":"https://audio.simplecast.com/a04334b2.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS8wMDNmMDc5Ny5tcDM=","title":"The Good Place Week: Mike Schur","description":"Episode 3 of The Good Place week shines a light on the man behind the curtain, Mike Schur. Mike (The Office, Parks and Recreation, Brooklyn 99) sits down with the Armchair Expert to discuss his philosophy on always “punching up”, he breaks down white privilege, details the many facets of showrunning and he gives a sweet anecdote that sums up Regis Philbin’s character. Dax and Mike discuss the virtues and pitfalls of Andrew Dice Clay, they talk about Mike’s attraction to equality and they come to the conclusion that Ted, Mike and Kristen would be the perfect threesome to pickpocket.\n","publishedDate":"Wed, 26 Sep 2018 01:00:00 -0700","duration":"01:59:52","audioUrl":"https://audio.simplecast.com/003f0797.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS83ZjM2YWRkMS5tcDM=","title":"The Good Place Week: D'Arcy Carden","description":"The Good Place week episode 2 is brought to you by American actress, comedian, and most lovable robot, D’Arcy Carden. D’Arcy sits down with the Armchair Expert to discuss her epiphany about confidence, she reveals which bodily function made her husband fall in love with her and she talks about the struggle with making a non-human character resonate with humans.  The two talk about the ethical dilemma of student/teacher relationships, D’Arcy perfects the O’Reilly jingle and Dax, as to be expected, loves D’Arcy’s dad.\n","publishedDate":"Tue, 25 Sep 2018 01:00:00 -0700","duration":"01:48:21","audioUrl":"https://audio.simplecast.com/7f36add1.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS83N2RkNjU4Ni5tcDM=","title":"The Good Place Week: Ted Danson","description":"The Good Place week commences with American actor, producer and National Treasure, Ted Danson. Ted sits down with the Armchair Expert to reminisce on his early years in an unconventional upbringing, he explains the juxtaposition between playing a cool guy on TV despite feeling profoundly uncool in life and he discusses his ride through life on the back of a pickup truck. Dax refers to the first time he met Ted on the street in 1996 and he laments being unable to pronounce Ted’s name. Ted reveals the secret behind being deemed MVP and the two of them share an undying love for Kristen Bell.\n","publishedDate":"Mon, 24 Sep 2018 01:00:00 -0700","duration":"02:08:46","audioUrl":"https://audio.simplecast.com/77dd6586.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9lMTUyNzFhOC5tcDM=","title":"Ike Barinholtz","description":"Ike Barinholtz (Mad TV, The Mindy Project, Neighbors, Blockers) is an American comedian, screenwriter, actor and most likable human. Ike sits down with the Armchair Expert to discuss his time on Mad TV, he recalls lying to his parents about dropping out of college and he details a demoralizing job as a telemarketer. Dax attributes his current sense of humor to a young encounter with men on work release and Ike is too tired to make love at night. Dax and Ike do impressions of nearly every human and they both agree that the most terrible experiences make the best stories.\n","publishedDate":"Mon, 17 Sep 2018 01:00:00 -0700","duration":"02:14:46","audioUrl":"https://audio.simplecast.com/e15271a8.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS8xNjgwZmUwZS5tcDM=","title":"Kathryn Hahn","description":"Kathryn Hahn (Anchorman: The Legend of Ron Burgundy, Step Brothers, Bad Moms, Transparent) is an American actress, comedian and special soul. Kathryn sits down with the Armchair Expert to talk about her early experience with facades and vulnerability, she discusses the different facets of monogamy and she enlightens us on her young obsession with the Amish.  Dax and Kathryn fall in love with each other over their shared taste in music, they discuss defensiveness in the current political climate and they find closure and healing on a previous awkward interaction. Monica battles some demons while Dax battles some gas in the fact check.\n\nListen to an exclusive preview of Ellen on the Go: http://www.wondery.fm/dax\n","publishedDate":"Mon, 10 Sep 2018 01:00:00 -0700","duration":"02:46:40","audioUrl":"https://audio.simplecast.com/1680fe0e.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9mMTE1ZWM3Mi5tcDM=","title":"EXPERTS ON EXPERT: Keith Morrison","description":"In this episode of Experts on Expert, the Armchair Expert speaks with broadcast journalist and Dateline correspondent Keith Morrison about the difference between Canadian journalism and American journalism, his reluctance to appear self-aggrandizing and his most haunting experience as a journalist. Dax praises Keith's spectacular ability to craft language and Keith tells the story of how he cut off his thumb. The two discuss the impossible role of a step-parent, the correct way to evade spousal homicide and the duality of career ambition.\n","publishedDate":"Thu, 06 Sep 2018 01:00:00 -0700","duration":"02:05:06","audioUrl":"https://audio.simplecast.com/f115ec72.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS8yMTlkMTUyZi5tcDM=","title":"Matthew Lillard","description":"Matthew Lillard (Serial Mom, Scream, Scooby Doo, The Descendants, Good Girls) is an American actor, voice actor, director, producer and human lighthouse. Matthew sits down with the Armchair Expert to discuss his early experience as a mime named TTAM, having to reinvent his life after an inexplicable period of not working and he labels his ultimate pursuit to remain artistic. Dax decides Matthew was the right man to date the love of his life and Matthew tells the story of how he was cast as the man who stole George Clooney's wife. The two of them travel down memory lane in a sweet recount of their love affair despite Matthew's insistence that they would never remain friends after Without A Paddle.\n","publishedDate":"Mon, 03 Sep 2018 01:00:00 -0700","duration":"02:18:26","audioUrl":"https://audio.simplecast.com/219d152f.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS84YzY3YzIzNi5tcDM=","title":"Jason Bateman","description":"Jason Bateman (Arrested Development, Silver Spoons, Juno, Ozark) is an American actor, director, producer and longtime friend of the Armchair Expert. Jason sits down with Dax to discuss tales of sobriety, parenthood and the formula for a deadpan delivery. Jason reveals his many idiosyncrasies and Dax credits Jason for proposing to Kristen. The two of them chat about their mutual ex-scumbaggery, they reminisce on Dax's nude scene in This is Where I Leave You and Dax defends his unique style of wiping his butt.\n","publishedDate":"Mon, 27 Aug 2018 01:00:00 -0700","duration":"02:19:23","audioUrl":"https://audio.simplecast.com/8c67c236.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS83ZjliYmQ3ZS5tcDM=","title":"Colin Hanks & Allison Tolman","description":"In this special FARGO combo episode of Armchair Expert, Colin Hanks (Orange County, King Kong, Life In Pieces) and Allison Tolman (Downward Dog, Krampus, Good Girls) sit down with the armchair expert to discuss one of Dax and Monica's favorite TV shows, Fargo. Colin discusses the balance between work and family, how he was almost cast as Dax's role in Zathura and the misconceptions people assume about his life and childhood. Allison talks about what it was like doing press with an animal, her relationship to fame and she shares her experience with depression. Monica and Dax fact check out of Austin, TX where they discuss the world record for treading water.\n","publishedDate":"Mon, 20 Aug 2018 01:00:00 -0700","duration":"02:54:29","audioUrl":"https://audio.simplecast.com/7f9bbd7e.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS82MTgyYTQ4Ny5tcDM=","title":"Seth Rogen","description":"Seth Rogen (Freaks and Geeks, Knocked Up, Superbad, Pineapple Express, Steve Jobs) is a Canadian actor, voice actor, comedian, writer, producer, director and one of the most prolific humans to walk into the attic. Seth sits down with the Armchair Expert to discuss how karate gave him an incongruous level of confidence, he talks about his relationship to marijuana and doing stand up comedy at the age of 13. Dax commends Seth's healthy relationship with money and Seth shares his personal feelings on the Sony hack. The two of them discuss working with their wives, Seth details the benefits of not procreating and Dax shares a story in which he passed up an opportunity to audition for The 40-Year-Old Virgin.\n","publishedDate":"Mon, 13 Aug 2018 01:00:00 -0700","duration":"02:26:38","audioUrl":"https://audio.simplecast.com/6182a487.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9kOWQ1ODdkOC5tcDM=","title":"Vincent D'Onofrio","description":"Vincent D’Onofrio (Full Metal Jacket, Daredevil, Law & Order: Criminal Intent) is an American actor, producer and one of Dax’s acting heroes. Vincent sits down with the Armchair Expert to discuss his struggle during childhood, the series of events that led to Full Metal Jacket and his aversion to sports metaphors. Dax refuses to accept he wasn’t cast in Vincent’s movie and Vincent is disturbed by the dog print in the attic. They talk about their mutual reluctance to owe others in any capacity, Dax implores Vincent to move into his house and Monica loves magicians. \n","publishedDate":"Mon, 06 Aug 2018 01:00:00 -0700","duration":"02:08:03","audioUrl":"https://audio.simplecast.com/d9d587d8.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS85ZWVkYTg0ZC5tcDM=","title":"EXPERTS ON EXPERT: Jon Favreau","description":"Jon Favreau an American political commentator, creator and co-host of Pod Save America and the former Director of Speechwriting for President Barack Obama. In this chapter of Experts on Expert, Jon discusses his heartbreak on the 2004 Kerry campaign, his devotion to the democratic ideal of persuasion and he details his farcical experience sharing a name with the other Jon Favreau.  Dax chooses to see America as two spouses in a rocky marriage and Jon shares the story of his first meeting with Barack Obama. The two debate whether it's productive to be inundated with current events, they pinpoint what distinguishes an average speech from a great one and Dax wonders if Jon is the Ma Anand Sheela to Obama's Bhagwan.\n","publishedDate":"Thu, 02 Aug 2018 01:00:00 -0700","duration":"02:00:00","audioUrl":"https://audio.simplecast.com/9eeda84d.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS81OTJjZTc1ZC5tcDM=","title":"David Harbour","description":"David Harbour (Stranger Things, The Green Hornet, Revolutionary Road) is an American actor and the man Dax deems the most masculine man to walk into the attic. David sits down with the Armchair Expert to discuss his proclivity for denouncing intellectuals, his fear that we are losing our empathy and his experience with bipolar disorder.  David debunks the misconception that affliction is necessary for creativity and Dax details the mechanics of the microwave oven. Dax and David bond over the benefits of AA, their mutual feelings of self-loathing and Monica teaches Dax a new phrase in the fact check.\n","publishedDate":"Mon, 30 Jul 2018 01:00:00 -0700","duration":"02:50:41","audioUrl":"https://audio.simplecast.com/592ce75d.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS80ZTE5NmE5ZS5tcDM=","title":"Mila Kunis","description":"Mila Kunis (Black Swan, Forgetting Sarah Marshall, That 70’s Show, Friends with Benefits) is an American actress, producer and self-proclaimed armcherry. She sits down with the Armchair Expert to discuss her immigration to America at the age of seven, her commitment to exploring various roles and her personal evolution to knowing her worth. Mila talks about her decision to openly embrace her flaws and Dax is shocked by Mila’s startlingly high level of adjustment. The two discuss Mila’s relationship with her family, they share tools on how to avoid conflict and per Mila’s request, Dax shares a very intimate story involving Jello and an STD clinic. \n","publishedDate":"Mon, 23 Jul 2018 01:00:00 -0700","duration":"02:40:21","audioUrl":"https://audio.simplecast.com/4e196a9e.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9lZDNkMmQ3Yy5tcDM=","title":"Nick Kroll","description":"Nick Kroll (Kroll Show, The League, Big Mouth) is an American actor, comedian, writer, producer and Dax’s favorite person to run into on the street. Nick sits down with the armchair expert to discuss his inability to stay awake, his first game night at Kristen Bell’s house and how his family’s wealth informed his current relationship to money. Nick talks about his most informative working experience and Dax shares his run-in with Mike Tyson. The two bond over a shared proclivity to say the exact wrong thing, they debate which car Nick should be driving and they discuss puberty in all its glory.\n","publishedDate":"Mon, 16 Jul 2018 01:00:00 -0700","duration":"02:17:49","audioUrl":"https://audio.simplecast.com/ed3d2d7c.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9mY2FiZmUyNC5tcDM=","title":"EXPERTS ON EXPERT: David Sedaris","description":"In this episode of Experts on Expert, the Armchair Expert speaks to author and humorist, David Sedaris about behavioral tics, and value of writing without preciousness and his provocative encounters at book signings.  David talks about the authors he is inspired by and Dax tells a story about why he can't drink Pellegrino. The two of them breakdown the dilemma of sharing family stories, the current culture of sensitivity and their mutual path to sobriety.\n\nDavid Sedaris -- is the author of Barrel Fever, Naked, Holidays on Ice, Me Talk Pretty One Day, Dress Your Family in Corduroy and Denim, When You are Engulfed in Flames, Squirrel Seeks Chipmunk, Let's Explore Diabetes with Owls and Theft by Finding. He is a contributor to The New Yorker and BBC Radio 4.\n","publishedDate":"Thu, 12 Jul 2018 01:00:00 -0700","duration":"01:57:37","audioUrl":"https://audio.simplecast.com/fcabfe24.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9kMWE0NDIwYy5tcDM=","title":"Portugal. The Man (John Gourley & Zachary Carothers)","description":"John Gourley and Zachary Carothers are members of the American Rock Band, Portugal. The Man. They sit down with the Armchair Expert to discuss the pressure of following up a Grammy, dog sled culture in Alaska, and the value of paying homage to other artists. Zach and John give insight into recording artists they admire and Dax is baffled at their general lack of jackassery. They talk about the elusiveness of a pop hit, the highs and lows of being \"known\" and Monica and Dax reach new levels of indecency in the fact check.\n","publishedDate":"Mon, 09 Jul 2018 01:00:00 -0700","duration":"02:00:54","audioUrl":"https://audio.simplecast.com/d1a4420c.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS8wNzM3MzZlNy5tcDM=","title":"Dax's Mom (Laura Labo)","description":"Laura Labo (Dax's Mom) is an American entrepreneur, businesswoman and Dax's #1 love of his life. In this special episode, Laura sits down with the Armchair Expert to discuss her life story, the mistakes that made her and the struggle of raising a family as a single mother. Dax describes the many reasons he loves her and Laura talks about the recent death of her husband. The two of them travel down memory lane in a delightful and endearing lovefest in which they talk about Laura's bouts with depression, the impetus for Dax's love addiction and the exact degree of ugliness to which Dax was as a baby.\n","publishedDate":"Mon, 02 Jul 2018 01:00:00 -0700","duration":"02:39:13","audioUrl":"https://audio.simplecast.com/073736e7.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS8zMjMzMzVlMy5tcDM=","title":"Mae Whitman","description":"Mae Whitman (Parenthood, Perks of Being a Wallflower, Hope Floats, Good Girls) is an American actress and singer, but paramount to all of that she is Dax's sweet bebe. Mae sits down with the Armchair Expert to discuss her 28 year long career as an actress, how she juggled acting and childhood, and she doubles down on her undying love of Taylor Swift. In this lovefest, Dax gush's over Mae's superior personality and Mae talks about her experience doing full nudity on stage. The two of them reveal their salacious plot to have more scenes together on Parenthood, they reminisce on a very specific facial expression that brought the two of them together and Monica and Dax debate the tired topic of how to pronounce Caribbean. \n","publishedDate":"Mon, 25 Jun 2018 01:00:00 -0700","duration":"02:16:27","audioUrl":"https://audio.simplecast.com/323335e3.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS82NjI3YzFjMi5tcDM=","title":"Kaitlin Olson","description":"Kaitlin Olson (It's Always Sunny In Philadelphia, Finding Dory, The Mick) is an American actress, producer, comedian and one of Dax's first friends in Los Angeles. Kaitlin sits down with the Armchair Expert to discuss a childhood accident that sparked years of insecurity, her need for perfection and her struggle with balancing motherhood and work. Dax and Kaitlin speculate on why they got kicked out of the Groundlings, their mutual undying love for Rob McElhenney and a drug-induced adventure that ultimately resulted in Dax getting bit by a seal. Dax waxes poetic on the character qualities of Kaitlin's father and Monica and Dax debate the color of Lori Loughlin's hair.\n","publishedDate":"Mon, 18 Jun 2018 02:00:00 -0700","duration":"02:00:34","audioUrl":"https://audio.simplecast.com/6627c1c2.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS8wYmFiOTUyNS5tcDM=","title":"Talib Kweli","description":"Talib Kweli is an American hip hop recording artist, entrepreneur and social activist. He sits down with the Armchair Expert where they have an honest debate about many social issues plaguing America today. They touch on all of the topics one would generally avoid at the dinner table including race, gender and religion. In addition, Talib talks about his place in the hip-hop world, his parents' emphasis on education and his counterview to Sam Harris. Dax and Talib reminisce about an altercation they teamed up on, they talk about their mutual worship of Jay Z and Monica discusses the gender patterns she's observed from working on the podcast.\n","publishedDate":"Mon, 11 Jun 2018 02:00:00 -0700","duration":"02:53:55","audioUrl":"https://audio.simplecast.com/0bab9525.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS8xY2EzMDA3ZS5tcDM=","title":"EXPERTS ON EXPERT: Wendy Mogel","description":"In this inaugural episode of Experts on Expert, the Armchair Expert speaks to author and child psychologist,  Dr. Wendy Mogel about human patterns of behavior, the impact of social media on the family and the importance of free-reign grandparenting. Wendy gives advice on how to speak to children and Dax asks for reassurance on his parenting strategy. The two of them breakdown the moral dilemma of behavioral diagnoses, the role of fear and Wendy discusses a study that uncovered the one thing every child wishes they could tell their parents.\n\nDr. Wendy Mogel is a practicing clinical psychologist in Los Angeles, New York Times bestselling author and international public speaker.\n","publishedDate":"Thu, 07 Jun 2018 02:00:00 -0700","duration":"02:00:40","audioUrl":"https://audio.simplecast.com/1ca3007e.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS84MmFkYzM4Yi5tcDM=","title":"Erika Christensen","description":"Erika Christensen (Traffic, Swimfan, Parenthood) is an American actress and one of Dax's most beloved TV sisters. Erika sits down with the Armchair Expert to discuss her journey as a child actor, her emphasis on clarity and recall, and the areas in which Scientology has informed her worldview. Erika details her days as a cyclist and Dax talks about his favorite scene on Parenthood, They discuss some of their earliest memories of one another, the importance of B vitamins and how bystanders could easily have mistaken them for lovers. Dax, also, reveals the location of the best grilled cheese on planet earth.\n","publishedDate":"Mon, 04 Jun 2018 02:00:00 -0700","duration":"02:14:05","audioUrl":"https://audio.simplecast.com/82adc38b.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS8yOWU5NzZjNi5tcDM=","title":"Johnny Knoxville","description":"Johnny Knoxville (Jackass, Jackass The Movie, Jackass Presents: Bad Grandpa, The Ringer) is an American actor, producer, screenwriter and stunt performer. He sits down with the Armchair Expert to discuss his early relationship with hospitals, his love of hillbilly culture and the mindset he enters before attempting a stunt. Johnny details some of his notable injuries and Dax reveals why he thought Johnny didn't like him. The two talk about the power of children to save their parents, the importance of discretion when picking your heroes and Dax and Monica discuss why it's okay to put your feet on the couch.\n","publishedDate":"Mon, 28 May 2018 02:00:00 -0700","duration":"01:44:46","audioUrl":"https://audio.simplecast.com/29e976c6.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9lZmU1MmI3NS5tcDM=","title":"Marc Maron","description":"Marc Maron (WTF with Marc Maron, Maron, Glow) is an American comedian, actor, podcast host and the impetus for Armchair Expert. In this episode, Marc discusses his trajectory toward success, the license that comes with playing flawed characters and the particularly intimate connection between podcast hosts and their audience. Dax and Marc hash out an uncomfortable text exchange they had a few months back and the two of them question whether achieving success has the power to heal wounds. They discuss the importance of having a flexible identity, the emphasis stand ups place on paying your dues and Dax warns of the dangers of chess.\n","publishedDate":"Mon, 21 May 2018 02:00:00 -0700","duration":"01:19:45","audioUrl":"https://audio.simplecast.com/efe52b75.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS85MGQzNTYxZi5tcDM=","title":"Bob Mervak","description":"Bob Mervak is an American pianist, vocalist, songwriter and studio writer. He sits down at his keyboard to share some music and conversation with the Armchair Expert. Bob discusses his childhood best friendship with Kristen Bell, the experience of composing a movie score and what it was like to play music for George Clooney.  Bob talks about the importance of enjoying music regardless of its technical proficiency and Dax serenades us with a very blue rendition of Silver Bells. The two question whether young platonic relationships are possible, they unpack how to navigate jealousy among friends and Monica deems Bob the most talented person she's ever met.\n","publishedDate":"Mon, 14 May 2018 02:00:00 -0700","duration":"01:55:37","audioUrl":"https://audio.simplecast.com/90d3561f.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9kMTZmMDI4YS5tcDM=","title":"Joel McHale","description":"Joel McHale (The Soup, Community, The Joel McHale Show with Joel McHale) is an American comedian, actor and television host extraordinaire. Joel sits down with Dax to discuss his childhood diagnosis of “slow starter,” the trap of overcommitment and the hang up’s that come from working in reality TV. Joel impresses Dax with his stature and Dax opens up a controversial conversation about societal punishment. The two talk about the evolutionary benefit of dyslexia, their mutual experience with short-term memory loss and it is revealed (spoiler!) that they are actually the same person living in two bodies.\n","publishedDate":"Mon, 07 May 2018 02:00:00 -0700","duration":"01:29:03","audioUrl":"https://audio.simplecast.com/d16f028a.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS8xNTExYjY5Yi5tcDM=","title":"Chris Hardwick","description":"Chris Hardwick is an American stand-up comedian, actor, voice actor, television host, writer, producer, podcaster and king of the world. Chris takes time out of his impossibly busy schedule to sit down with the Armchair Expert and discuss his road to sobriety, the Dunning-Kruger effect, the entrapment of confirmation bias and why we should all be referring to bowling alleys as bowling centers. Chris reveals why calculating data is the trick to betterment and Dax unfairly accuses Chris of having high self-esteem. The two of them debate whether or not we are currently living in a matrix, the reason humans gravitate toward conspiracy theories and Monica adds Chris to her list of #MonicaLovesBoys.\n","publishedDate":"Mon, 30 Apr 2018 02:00:00 -0700","duration":"01:52:18","audioUrl":"https://audio.simplecast.com/1511b69b.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9lNzdlMmYwOC5tcDM=","title":"Seth Green","description":"Seth Green is an American actor, voice artist, comedian, producer, writer, director and one of Dax's true loves of his life. Seth sits down with the Armchair Expert to travel down memory lane and discuss how Seth got Dax cast in Without A Paddle, why Seth was the worst mark in Punk'd history and Seth's affinity for zero gravity. Seth talks about his experience as a first time director and Dax chronicles the 72 hours he spent on their press tour that ultimately led to his relapse. They talk about their mutual experience working with a real bear, Seth's fame as the Rally's Cha-Ching guy and Dax commends Seth for his unmatched integrity.\n","publishedDate":"Mon, 23 Apr 2018 02:00:00 -0700","duration":"01:45:14","audioUrl":"https://audio.simplecast.com/e77e2f08.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS84NTM2OTg0OC5tcDM=","title":"Katie Couric","description":"Katie Couric is an American journalist, author and general badass. Katie sits down with the Armchair Expert to talk about her new documentary series, the current societal emphasis on political correctness, the influx of confirmation bias and her personal experience losing a spouse. Dax debates the efficacy of empathy and Katie implores our listeners to rename her podcast. Dax and Katie discuss her watershed interview with Sarah Palin, the balance between work and motherhood and Monica and Dax, yet again, broach a fiery hot-button topic during the fact check.\n","publishedDate":"Mon, 16 Apr 2018 02:00:00 -0700","duration":"02:05:11","audioUrl":"https://audio.simplecast.com/85369848.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9jM2QwM2MyNC5tcDM=","title":"Lauren Graham","description":"Lauren Graham (Gilmore Girls, Parenthood, Bad Santa, Evan Almighty) is an American actress, author and is Dax's beloved TV sister. Lauren sits down with Dax to discuss her colorful childhood, the fear of slowing down and her lack of a maternal influence. Lauren expresses a reluctance to accept social media and Dax shares a method he implemented to curb addiction. They touch on their mutual appreciation for Parenthood, how Chaz Dean transformed the LA billboard scene, and Dax and Monica have an inane debate over the attractiveness of a capella performers.\n","publishedDate":"Mon, 09 Apr 2018 02:00:00 -0700","duration":"01:51:17","audioUrl":"https://audio.simplecast.com/c3d03c24.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS8wM2UyMmJmZC5tcDM=","title":"Zach Braff","description":"Zach Braff (Scrubs, Garden State, Alex Inc.) is an American actor, writer and producer. In this doppelgänger episode, Zach and Dax discuss the unending hardship of being recognized as the other, the first time they were sexually aroused and their mutual love of Brad Pitt and Natalie Portman. Zach talks about his experience of growing up with therapist parents and Dax details his Shaun Of The Dead moment. The two of them discuss the emotional trap of dating “out of their league”, the uphill battle of being a writer and Dax regales the world with his Mike Tyson impression.\n","publishedDate":"Mon, 02 Apr 2018 02:00:00 -0700","duration":"02:10:19","audioUrl":"https://audio.simplecast.com/03e22bfd.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9iOGU4ZWViNC5tcDM=","title":"Anna Faris","description":"Anna Faris (Scary Movie, The House Bunny, Mom, Anna Faris is Unqualified Podcast) is an American actress, producer and comedian. Anna and Dax crack open a can of Redbull and discuss honesty in parenting, becoming the mayor of The Grove shopping mall and gender roles in partnerships. Dax reveals the details of his open relationship and Anna questions the potential negative effect of pornography.  The two of them dissect the pay disparity between men and women, the expectations that come with being in a #couplegoals relationship and Dax tells the story of how they were both sent to Hawaii to eat a piece of chocolate.\n","publishedDate":"Mon, 26 Mar 2018 02:00:00 -0700","duration":"01:51:46","audioUrl":"https://audio.simplecast.com/b8e8eeb4.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9lOGNmM2QwNS5tcDM=","title":"Van Hunt","description":"Van Hunt is an American singer, songwriter, multi-instrumentalist, record producer and one of Dax’s longtime obsessions. Van sits down with the armchair expert to discuss his colorful upbringing, his unconventional musical process and the connection between music and comedy. The two of them bond over a history of strong mothers and they ask the question scholars have been debating since the beginning of time: are blind people really blind? Van explains his acceptance of never fitting into a box and Dax practically croaks as Van sings live for the podcast. Monica and Dax debate a controversial topic during the fact check and yet they still like each other at the end of it.  Thus, proving the impossible- respectful disagreement can exist!\n","publishedDate":"Mon, 19 Mar 2018 02:00:00 -0700","duration":"02:10:21","audioUrl":"https://audio.simplecast.com/e8cf3d05.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9iOTRmMTNjNC5tcDM=","title":"Ellen DeGeneres","description":"Ellen DeGeneres (Ellen, The Ellen DeGeneres show) is an American comedian, daytime talk show host, actress, writer, producer and one of Dax’s true loves. Ellen sits down with Dax in her podcast debut to discuss getting invited to Johnny Carson’s couch, reinventing a career at age 45 and the fall out of her public coming out. Dax admits men are disgusting and Ellen reveals she questioned whether she would make it to adulthood. They talk about what its like to be an unintentional advocate for an entire community, the need to be free from secrets and Dax makes a public declaration that he’d like to kiss Ellen more.\n","publishedDate":"Mon, 12 Mar 2018 02:00:00 -0700","duration":"00:53:10","audioUrl":"https://audio.simplecast.com/b94f13c4.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS82YjdkYjgzOC5tcDM=","title":"Adam Scott","description":"Adam Scott (Parks and Recreation, Big Little Lies, Step Brothers) is an actor, producer and genuinely one of the nicest people Dax has ever hated.  Adam sits down with the armchair expert to discuss how he fell backwards into comedy after seeking a career in dramatic acting, his hero worship of Spike Lee and the two of them discuss why they had a mutual unappreciation for the other before they met. Dax tells the story of how he unpredictably ended up on Letterman and Adam speaks about his struggle with self-worth and recognizability.  They examine their differing perspectives on being a younger sibling, Dax commends Adam for taking on projects he loves and they both agree, unequivocally, that Will Ferrell is the greatest.\n","publishedDate":"Mon, 05 Mar 2018 02:00:00 -0800","duration":"01:45:53","audioUrl":"https://audio.simplecast.com/6b7db838.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS80ODBlOGEzZS5tcDM=","title":"Pete Wentz","description":"Pete Wentz (Fall Out Boy) is an American musician and the kindest rock star Dax has ever known. In this episode of Armchair Expert, Pete sits down with Dax to examine his journey as a young musician, he explains how his son pulled him out of a depression and he tells the story of how James Gandolfini accidentally promoted his new bar.  Dax talks about hitting his rock bottom in Hawaii and Pete reveals his connection to Muhammad Ali.  They explore what it’s like to be a normal person turned role model, the inevitable infantilization that accompanies fame, how to balance artistic integrity and supplying a product, and Dax struggles to uncover Fall Out Boy’s vice.\n","publishedDate":"Mon, 26 Feb 2018 02:00:00 -0800","duration":"02:11:03","audioUrl":"https://audio.simplecast.com/480e8a3e.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9iZjExZjU1Yi5tcDM=","title":"Jimmy Kimmel","description":"Jimmy Kimmel (Jimmy Kimmel Live, The Man Show, Win Ben Stein's Money) is a late night host, comedian and one of Dax's best friends who he never sees. In this episode of Armchair Expert, Dax and Jimmy discuss the origin of Jimmy Kimmel Live and why tomatoes are fascinating. Jimmy recounts how he accidentally learned to play the clarinet, the time he willed a tsunami into existence and he reveals Dax's next birthday present. Dax talks about his scariest adult moment to date and how Jimmy is getting better looking by the second. They discuss the experience of using their platforms for political exposure and Dax re-lives the moment when he realized with certainty: Jimmy Kimmel is mean.\n","publishedDate":"Mon, 19 Feb 2018 02:00:00 -0800","duration":"01:58:50","audioUrl":"https://audio.simplecast.com/bf11f55b.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9jNzk5YzMxYy5tcDM=","title":"Joy Bryant","description":"Joy Bryant (Parenthood, Good Girls Revolt, Antwone Fisher) is an actress, writer, model and played Dax's TV wife for 6 years on NBC’s Parenthood. In this episode of Armchair Expert, Joy and Dax touch on their favorite subject: race in America. They also discuss their sense memory of government cheese, how humans code switch to match their environment, the sociological experience of doing drugs and how to reframe negative perspectives of their childhood. Most importantly they acknowledge their mutual appreciation for sleeping with celebrities.\n","publishedDate":"Wed, 14 Feb 2018 02:00:00 -0800","duration":"02:13:33","audioUrl":"https://audio.simplecast.com/c799c31c.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS81MDNmMjQ2Zi5tcDM=","title":"Ashton Kutcher","description":"Ashton Kutcher (The Ranch, That 70's Show) is an actor, investor and the prime person Dax credits for his break into Hollywood. In this episode of Armchair Expert, Ashton and Dax discuss their time on Punk'd together, feeling stuck in the cultural zeitgeist as one particular role and the sisyphean climb to satisfaction. Ashton discusses commerce, art, and the importance of social influence in entertainment. They, also, talk about what it's like to be married to powerhouse ladies, the difference between pity and compassion and they delve deep into their mutual struggle against balding.\n","publishedDate":"Wed, 14 Feb 2018 01:30:00 -0800","duration":"02:04:51","audioUrl":"https://audio.simplecast.com/503f246f.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS85ODBhMjA3Yy5tcDM=","title":"Kristen Bell","description":"Kristen Bell (The Good Place, Veronica Mars, Frozen, Bad Moms) is an actress, singer, philanthropist and married to the most handsome man in the universe. In this inaugural episode of Armchair Expert, Kristen and Dax discuss what makes their marriage work and Dax recounts why he assumed Kristen had breast implants for the first three months of dating. Kristen explains her life philosophy and how it dictates her every decision and she warns people of why they should never sit next to her in a movie. The two of them question their impact on social media and Dax reveals the worst thing he has ever done.\n","publishedDate":"Wed, 14 Feb 2018 01:00:00 -0800","duration":"02:00:41","audioUrl":"https://audio.simplecast.com/980a207c.mp3"},{"id":"aHR0cHM6Ly9hdWRpby5zaW1wbGVjYXN0LmNvbS9mYTRhNDZjMi5tcDM=","title":"Introducing: Armchair Expert with Dax Shepard ","description":"Hi, I’m Dax Shepard, and I love talking to people. I am endlessly fascinated by the messiness of being human, and I find people who are vulnerable and honest about their struggles and shortcomings to be incredibly sexy. I invite you to join me as I explore other people’s stories. We will celebrate, above all, the challenges and setbacks that ultimately lead to growth and betterment.\n\nWhat qualifies me for such an endeavor? More than a decade of sobriety, a degree in Anthropology and four years of improv training. I will attempt to discover human “truths” without any laboratory work, clinical trials or data collection. I will be, in the great tradition of 16th-century scientists, an Armchair Expert.\n","publishedDate":"Tue, 06 Feb 2018 13:00:00 -0800","duration":"00:03:32","audioUrl":"https://audio.simplecast.com/fa4a46c2.mp3"}]}